TecnicasTP/app/Models/comentarioModel.php

SELECT `c`.`Codigo`, `c`.`Comentario`, `u`.`Nombre`, `u`.`Apellido`
FROM `comentarios` `c`
JOIN `usuarios` `u` ON `u`.`Codigo` = `c`.`CodigoUsuario`
WHERE `c`.`CodigoSubtarea` = '2'
---
        public function buscoPorSubtarea($codigoS){
            //Traigo las tareas de la BD
            $bd = \Config\Database::connect();
            $tablaComentarios = $bd->table('comentarios c');

            //Realizo el inner join de las tablas prioridades, estados y colores
            $tablaComentarios->select('c.Codigo,c.Comentario,u.Nombre,u.Apellido');
            $tablaComentarios->join('usuarios u', 'u.Codigo = c.CodigoUsuario');
            $tablaComentarios->where('c.CodigoSubtarea', $codigoS);
            $comentarios = $tablaComentarios->get()->getResultArray();