TecnicasTP/app/Models/estadoSubtareaModel.php

        public function devolverCodigo($nombreEstado){
            $estado = new estadoModel();
            $codigoEstado = $estado->where('Estado',$nombreEstado)->find();
---
SELECT *
FROM `estados`
WHERE `Estado` = 'Finalizada'