TecnicasTP/app/Models/subtareaModel.php

        public function traerSubtareas(){
            $bd = \Config\Database::connect();
            $tablaSTareas = $bd->table('subtareas s');

            //Realizo el inner join de las tablas prioridadesSubtareas, estadosSubtareas y coloresSubtareas
            $tablaSTareas->select('s.*, e.Estado');
            $tablaSTareas->join('estadossubtareas e', 'e.Codigo = s.CodigoEstado');
            $tablaSTareas->orderBy('s.CodigoPrioridad', 'DESC');
            $tablaSTareas->where('s.estaArchivada', 0);
            $subtareas = $tablaSTareas->get()->getResultArray();
---
SELECT `s`.*, `e`.`Estado`
FROM `subtareas` `s`
JOIN `estadossubtareas` `e` ON `e`.`Codigo` = `s`.`CodigoEstado`
WHERE `s`.`estaArchivada` = 0
ORDER BY `s`.`CodigoPrioridad` DESC

        public function traerArchivadas(){
            $bd = \Config\Database::connect();
            $tablaSTareas = $bd->table('subtareas s');

            //Realizo el inner join de las tablas prioridadesSubtareas, estadosSubtareas y coloresSubtareas
            $tablaSTareas->select('s.*, e.Estado');
            $tablaSTareas->join('estadossubtareas e', 'e.Codigo = s.CodigoEstado');
            $tablaSTareas->orderBy('s.CodigoPrioridad', 'DESC');
            $tablaSTareas->where('s.estaArchivada', 1);
            $subtareas = $tablaSTareas->get()->getResultArray();
---
SELECT `s`.*, `e`.`Estado`
FROM `subtareas` `s`
JOIN `estadossubtareas` `e` ON `e`.`Codigo` = `s`.`CodigoEstado`
WHERE `s`.`estaArchivada` = 1
ORDER BY `s`.`CodigoPrioridad` DESC

        public function traerSubtarea($codigo){
            //Conexión con la base de datos
            $bd = \Config\Database::connect();
            $tabla = $bd->table('subtareas s');

            //Variables para realizar el inner join
            $tabla->select('s.*,t.Titulo as TituloT,t.Codigo as CodigoT,e.Estado');
            $tabla->where('s.Codigo', $codigo);
            $tabla->join('tareas t','t.Codigo = s.CodigoTarea');
            $tabla->join('estados e','e.Codigo = s.CodigoEstado');
            $tarea = $tabla->get()->getResultArray();
---
SELECT `s`.*, `t`.`Titulo` as `TituloT`, `t`.`Codigo` as `CodigoT`, `e`.`Estado`
FROM `subtareas` `s`
JOIN `tareas` `t` ON `t`.`Codigo` = `s`.`CodigoTarea`
JOIN `estados` `e` ON `e`.`Codigo` = `s`.`CodigoEstado`
WHERE `s`.`Codigo` = '2'