TecnicasTP/app/Models/tareaModel.php

        public function traerTareas(){
            //Traigo las tareas de la BD
            $bd = \Config\Database::connect();
            $tablaTareas = $bd->table('tareas t');

            //Realizo el inner join de las tablas prioridades, estados y colores
            $tablaTareas->select('t.*, p.Prioridad, p.Codigo as CodigoP , e.Estado');
            $tablaTareas->join('prioridades p', 'p.Codigo = t.CodigoPrioridad');
            $tablaTareas->join('estados e', 'e.Codigo = t.CodigoEstado');
            $tablaTareas->where('t.estaArchivada', 0);
            $tareas = $tablaTareas->get()->getResultArray();
---
SELECT `t`.*, `p`.`Prioridad`, `p`.`Codigo` as `CodigoP`, `e`.`Estado`
FROM `tareas` `t`
JOIN `prioridades` `p` ON `p`.`Codigo` = `t`.`CodigoPrioridad`
JOIN `estados` `e` ON `e`.`Codigo` = `t`.`CodigoEstado`
WHERE `t`.`estaArchivada` = 0

        public function getOrdenadasPorPrioridad(){
            //Traigo las tareas de la BD
            $bd = \Config\Database::connect();
            $tablaTareas = $bd->table('tareas t');

            //Realizo el inner join de las tablas prioridades, estados y colores
            $tablaTareas->select('t.*, p.Prioridad, p.Codigo as CodigoP , e.Estado');
            $tablaTareas->join('prioridades p', 'p.Codigo = t.CodigoPrioridad');
            $tablaTareas->join('estados e', 'e.Codigo = t.CodigoEstado');
            $tablaTareas->orderBy('p.Codigo', 'DESC');
            $tablaTareas->where('t.estaArchivada', 0);
            $tareas = $tablaTareas->get()->getResultArray();
---
SELECT `t`.*, `p`.`Prioridad`, `p`.`Codigo` as `CodigoP`, `e`.`Estado`
FROM `tareas` `t`
JOIN `prioridades` `p` ON `p`.`Codigo` = `t`.`CodigoPrioridad`
JOIN `estados` `e` ON `e`.`Codigo` = `t`.`CodigoEstado`
WHERE `t`.`estaArchivada` = 1

        public function getOrdenadasPorFechaVencimiento(){
            //Traigo las tareas de la BD
            $bd = \Config\Database::connect();
            $tablaTareas = $bd->table('tareas t');

            //Realizo el inner join de las tablas prioridades, estados y colores
            $tablaTareas->select('t.*, p.Prioridad, p.Codigo as CodigoP , e.Estado');
            $tablaTareas->join('prioridades p', 'p.Codigo = t.CodigoPrioridad');
            $tablaTareas->join('estados e', 'e.Codigo = t.CodigoEstado');
            $tablaTareas->orderBy('t.FechaVencimiento', 'ASC');
            $tablaTareas->where('t.estaArchivada', 0);
            $tareas = $tablaTareas->get()->getResultArray();
---
SELECT `t`.*, `e`.`Estado`, `u`.`Nombre`, `p`.`Prioridad`
FROM `tareas` `t`
JOIN `estados` `e` ON `t`.`CodigoEstado` = `e`.`Codigo`
JOIN `usuarios` `u` ON `t`.`CodigoUsuario` = `u`.`Codigo`
JOIN `prioridades` `p` ON `t`.`CodigoPrioridad` = `p`.`Codigo`
WHERE `t`.`Codigo` = '2'

        public function traerTarea($codigo){
            //Conexión con la base de datos
            $bd = \Config\Database::connect();
            $tabla = $bd->table('tareas t');

            //Variables para realizar el inner join
            $tabla->select('t.*, e.Estado, u.Nombre, p.Prioridad');
            $tabla->join('estados e', 't.CodigoEstado = e.Codigo');
            $tabla->join('usuarios u', 't.CodigoUsuario = u.Codigo');
            $tabla->join('prioridades p', 't.CodigoPrioridad = p.Codigo');
            $tabla->where('t.Codigo', $codigo);
            $tarea = $tabla->get()->getResultArray();
---
SELECT `t`.*, `e`.`Estado`, `u`.`Nombre`, `p`.`Prioridad`
FROM `tareas` `t`
JOIN `estados` `e` ON `t`.`CodigoEstado` = `e`.`Codigo`
JOIN `usuarios` `u` ON `t`.`CodigoUsuario` = `u`.`Codigo`
JOIN `prioridades` `p` ON `t`.`CodigoPrioridad` = `p`.`Codigo`
WHERE `t`.`Codigo` = '4'

        public function devolverEstado($codigoSubtarea){
            //Conexión con la base de datos
            $bd = \Config\Database::connect();
            $tabla = $bd->table('tareas t');

            $tabla->select('t.Codigo,e.Estado');
            $tabla->join('estados e', 't.CodigoEstado = e.Codigo');
            $tabla->join('subtareas s', 's.CodigoTarea = t.Codigo');
            $tabla->where('s.Codigo', $codigoSubtarea);
            $estado = $tabla->get()->getResultArray();
---
SELECT `t`.`Codigo`, `e`.`Estado`
FROM `tareas` `t`
JOIN `estados` `e` ON `t`.`CodigoEstado` = `e`.`Codigo`
JOIN `subtareas` `s` ON `s`.`CodigoTarea` = `t`.`Codigo`
WHERE `s`.`Codigo` = '3'