TecnicasTP/app/Controllers/registrarse.php

        $pAnterior = $this->request->getPost('pAnterior');

        $usuarioModel = new usuarioModel();
        $usuario = $user = $usuarioModel->select('Password')->find($codigoUsuario);
---
SELECT `Password`
FROM `usuarios`
WHERE `usuarios`.`codigo` = '1'

             'Password' => password_hash($this->request->getPost('pNueva'), PASSWORD_DEFAULT,['cost' => 10])
            ];

            $usuarioModel->update($codigoUsuario, $data);
---
UPDATE `usuarios` SET `Password` = '$2y$10$Occb0Q0QKYTINnF7cfAdWuIfCiff8Lo.Mtyv4PE3gQjEylSZeOsrq'
WHERE `usuarios`.`codigo` IN ('1')