TecnicasTP/app/Controllers/subtarea.php

        //Traigo los comentarios de la subtarea
        $comentarios = $comentarios->buscoPorSubtarea($codigo);

        $datos = [
            'usuarios' => $usuario->findAll(),
            'subtarea' => $subtarea,
            'comentarios' => $comentarios
        ];
---
SELECT *
FROM `usuarios`

    public function formEstado($codigo){
        $selEstado = $this->request->getPost('selEstado');
        if ($selEstado !== null){
            $estado = new estadoSubtareaModel();
            $subtarea = new subtareaModel();

            //Le paso el estado y me devuelve el codigo de ese estado
            $CodigoEstado = $estado->devolverCodigo($selEstado);

            $data = [
                'CodigoEstado' => $CodigoEstado[0]['Codigo']
            ];

            $subtarea->update($codigo,$data);
---
UPDATE `subtareas` SET `CodigoEstado` = '3'
WHERE `subtareas`.`codigo` IN ('3')

    public function formPrioridad($codigoSubtarea){
        $selPrioridad = $this->request->getPost('selPrioridad');
        $prioridad = new prioridadesSubtareasModel();
        $subtarea = new subtareaModel();

        $codigoPrioridad = $prioridad->devolverCodigo($selPrioridad);

        $data = [
            'CodigoPrioridad' => $codigoPrioridad[0]['Codigo']
        ];

        $subtarea->update($codigoSubtarea,$data);
---
UPDATE `tareas` SET `CodigoEstado` = 2
WHERE `tareas`.`codigo` IN ('4')

    public function guardarSubtarea($data){
        $subtareaModel = new subtareaModel();

        //Creo la subtarea con el estado DEFINIDA
        $estadoModel = new estadoSubtareaModel();
        $codigoEstado = $estadoModel->where('Estado','Definida')->find();
        $data['CodigoEstado'] = $codigoEstado[0]['Codigo'];

        if(isset($data['Color'])){
            $colorModel = new colorSubtareaModel();
            $codigoColor = $colorModel->where('Valor',$data['Color'])->find();
            $data['CodigoColor'] = $codigoColor[0]['Codigo'];
        }

        if(isset($data['Prioridad'])){
            $prioridadModel = new prioridadesSubtareasModel();
            $codigoPrioridad = $prioridadModel->where('Prioridad',$data['Prioridad'])->find();
            $data['CodigoPrioridad'] = $codigoPrioridad[0]['Codigo'];
        }

        $subtareaModel->insert($data);
---
INSERT INTO `subtareas` (`CodigoUsuario`, `CodigoTarea`, `Titulo`, `Descripcion`, `CodigoEstado`, `CodigoColor`, `CodigoPrioridad`) VALUES ('1', '2', 'Primer subtarea', 'Esta es la primer subtarea que e creado', '1', '1', '1')