TecnicasTP/app/Controllers/tarea.php

SELECT *
FROM `estados`
WHERE `Estado` = 'Definida'
INSERT INTO `tareas` (`CodigoUsuario`, `Titulo`, `Descripcion`, `FechaVencimiento`, `CodigoEstado`, `CodigoPrioridad`) VALUES ('1', 'Tarea numero 1', 'Descripcion de la tarea 1', '2023-05-27', '1', '2')
---
    public function guardarTarea($data){
        $tareaModel = new tareaModel();

        //Creo la subtarea con el estado DEFINIDA
        $estadoModel = new estadoModel();
        $codigoEstado = $estadoModel->where('Estado','Definida')->find();
        $data['CodigoEstado'] = $codigoEstado[0]['Codigo'];

        $prioridadModel = new prioridadModel();
        $codigoPrioridad = $prioridadModel->where('Prioridad',$data['Prioridad'])->find();
        $data['CodigoPrioridad'] = $codigoPrioridad[0]['Codigo'];

        if(isset($data['Color'])){
            $colorModel = new colorModel();
            $codigoColor = $colorModel->where('Color',$data['Color'])->find();
            $data['CodigoColor'] = $codigoColor[0]['Codigo'];
        }

        $tareaModel->insert($data);